import React from 'react';

export default function TreeSwitcherIcon() {
  return (
    <svg
      width="10px"
      height="7px"
      viewBox="0 0 10 7"
      version="1.1"
      xmlns="http://www.w3.org/2000/svg"
    >
      <g id="页面-1" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
        <g id="基础建设" transform="translate(-245.000000, -149.000000)" fill="#666666">
          <g id="题库树备份-2" transform="translate(236.000000, 66.000000)">
            <path
              d="M14.7592566,83.8857994 L18.585036,88.3492086 C18.9444581,88.7685345 18.8958966,89.3998345 18.4765707,89.7592566 C18.2953276,89.9146078 18.0644906,90 17.8257794,90 L10.1742206,90 C9.62193589,90 9.17422064,89.5522847 9.17422064,89 C9.17422064,88.7612887 9.2596128,88.5304517 9.41496403,88.3492086 L13.2407434,83.8857994 C13.6001655,83.4664735 14.2314655,83.417912 14.6507914,83.7773341 C14.6896702,83.8106588 14.7259319,83.8469206 14.7592566,83.8857994 Z"
              id="三角形"
              transform="translate(14.000000, 86.500000) scale(1, -1) translate(-14.000000, -86.500000) "
            />
          </g>
        </g>
      </g>
    </svg>
  );
}
